{
    "posts": [
        {
            "title": "French Fries",
            "body": "French fries are undoubtedly one of the most loved snacks. The crunchy and crispy potatoes are irresistible and we usually end up eating more than we should. The fact is that these fries adds kilos to your frame. It is important to do moderate exercise or consume more fruits and vegetables. Occasional indulgence is, of course, acceptable and harmless.",
            "fat": "15",
            "calroie": "312",
            "ingredients": "Potatoes, Vegetable Oil, Citric Acid [Preservative]), etc",
            "img": "images/french-fries.jpg",
            "link": "https://www.nutritionix.com/food/french-fries",
            "id": 1
        },
        {
            "title": "Hot Dogs",
            "body": "Hot dogs taste amazing, but and are extremely unhealthy! Nearly 80% of their calories come from unhealthy saturated fat. The processed meat used in it increases the risk of heart disease and colon cancer. So, try and cut down the consumption of hot dogs. Go for healthier options like turkey sausages or lean chicken, which contain lesser fat. They are also good sources of high quality protein.",
            "fat": "26",
            "calroie": "290",
            "ingredients": "Meat trimmings and fat,salt, garlic, and paprika, etc",
            "img": "images/hot-dogs.jpg",
            "link": "https://www.nutritionix.com/search?q=Hot%20Dogs",
            "id": 2
        },
        {
            "title": "Bacon",
            "body": "Bacon can make everything all right with the world or so, say the bacon lovers! But bacon lovers should keep in mind that their favorite food is loaded with unhealthy salts and saturated fats. You can add small amounts of bacon to your vegetables to enjoy the taste without filling your body with unhealthy fat. You can also use it as a garnish by sprinkling crumbled bacon on a side dish of Brussels sprouts or a vegetable salad. Its salty and smoky flavor also improves the taste of other dishes.",
            "fat": "40",
            "calroie": "541",
            "ingredients": "pork, water, potassium lactate, salt, sugar, sodium phosphate, sodium diacetate, sodium erythorbate, sodium nitrite, smoke.",
            "img": "images/bacon.jpg",
            "link": "https://www.nutritionix.com/search?q=Bacon",
            "id": 3
        },
        {
            "title": "Theatre Popcorn",
            "body": "This popular theatre snack is loaded with calories and fat. These popcorn kernels are popped in enormous quantities of coconut oil, which contains more than 90% saturated fat. Besides, in theatres, most of us indulge in the habit of munching these snacks. A medium size packet contains 20 cups of popcorn. It packs about 1200 calories and 60 grams of saturated fat in it. Their calorie content is equivalent to 3 large sized fast food burgers.",
            "fat": "4.3",
            "calroie": "375",
            "ingredients": "salt, artificial butter flavor,etc",
            "img": "images/theatre-popcorn.jpg",
            "link": "https://www.nutritionix.com/search?q=Theatre%20Popcorn",
            "id": 4
        },
        {
            "title": "Toaster Pastries",
            "body": "These pastries are considered a breakfast treat, but they are the unhealthiest food to start your day with. Made up of white flour, these contain tones of added sugar. Even the fruit flavors are not derived from a real fruit. A serving of two pack toaster pastries contains a whopping 10 teaspoons of sugar. These can drastically increase your blood sugar levels accompanied by a mid-morning energy crash. So, avoid these pastries and look for a healthy alternative. ",
            "fat": "14",
            "calroie": "412",
            "ingredients": "GLYCERIN, STRAWBERRIES, WHITE GRAPE JUICE CONCENTRATE, WATER, MODIFIED TAPIOCA STARCH, PECTIN, CITRIC ACID, etc",
            "img": "images/toaster-pastries.jpg",
            "link": "https://www.nutritionix.com/search?q=Toaster%20Pastries",
            "id": 5
        },
        {
            "title": "Pizza",
            "body": "We all are in love with deep dish pizza because of its thick and dense crust that offers a great taste. But the excess dough in the crust can greatly increase your calorie count. Additionally, the fattening whole-milk cheese and greasy meat toppings comprising of bacon, sausage and pepperoni also add more calorie. A two slice serving can load your system with 1300 calories and 24 grams of saturated fat that clogs your arteries. It is difficult to give up your favorite pizza, but you need not do so.",
            "fat": "10",
            "calroie": "266",
            "ingredients": "Fresh Dough. Unbleached enriched wheat flour, water, sugar, soybean oil, salt, yeast, etc",
            "img": "images/pizza.jpg",
            "link": "https://www.nutritionix.com/search?q=Pizza",
            "id": 6
        },
        {
            "title": "Granola",
            "body": "This might come as a shock as granola is generally considered a healthy food. But, the fact is that this yummy breakfast cereal contains more sugar and too little fiber. Being high in sugar, just one cup serving of granola can provide 600 calories to your system. And it is almost one -third of an average woman’s daily requirement. So, replace granola with a crunchy cereal, which contains more fiber than sugar.",
            "fat": "20",
            "calroie": "471",
            "ingredients": "whole rolled oats, almonds, sunflower seeds,etc",
            "img": "images/granola.jpg",
            "link": "https://www.nutritionix.com/search?q=Granola",
            "id": 7
        },
        {
            "title": "Wraps",
            "body": "The little leaves of lettuce and slim slices of deli meat in a wrap seem like a nutritious option to most of us. But, the flat breads used in preparing these wraps can add 300 calories to your system. Besides the cheese, cold cuts and spread in them contain no less than 700 calories. Prepared from refined grains, most of the wraps do not contain enough fiber. ",
            "fat": "8",
            "calroie": "350",
            "ingredients": "Flour, Niacin, Reduced Iron, Thiamine Mononitrate, etc",
            "img": "images/wraps.jpg",
            "link": "https://www.nutritionix.com/search?q=Wraps",
            "id": 8
        },
        {
            "title": "Whole Milk",
            "body": "We all swear upon the health promoting qualities of milk. Rich in calcium and other vital nutrients, it is beneficial for people of all age groups. But whole milk contains saturated fat, which raises the cholesterol levels and triggers inflammation. It also leads to clogged arteries. However, this doesn’t mean that you should give up consuming milk. All you need to do is opt for skimmed (fat-free) or 1 % low fat milk. ",
            "fat": "3.25",
            "calroie": "42",
            "ingredients": "Whole Milk, Pure Cane Sugar, Moaroma Chocolate Power , etc",
            "img": "images/whole-milk.jpg",
            "link": "https://www.nutritionix.com/search?q=Whole%20Milk",
            "id": 9
        },
        {
            "title": "Sodas And Sweet Drinks",
            "body": "Sodas and sugary drinks are a regular sight in restaurants and supermarkets. But, few of us are aware of the fact that nearly 100% of the calories in regular soda come from sugar or high-fructose corn syrup. In fact, it is considered the real culprit behind obesity. It also damages your teeth and leads to cavity formation. Certain studies have shown that cola drinks can weaken your bones. Processed sugary drinks, such as bottled teas, sports and energy drinks, etc., can also drastically increase your calorie consumption without providing any nutrients. Plain water is the best alternative for these drinks that hydrates your body without providing extra calories",
            "fat": "0",
            "calroie": "42",
            "ingredients": "Coca-Cola (Classic) Carbonated water, high fructose corn syrup",
            "img": "images/drinks.jpg",
            "link": "https://www.nutritionix.com/search?q=Sodas%20And%20Sweet%20Drinks",
            "id": 10
        },
        {
            "title": "Ice Cream",
            "body": "Ice cream is offensive in many categories, with high levels of fat, saturated fat, sugar and calories. MedlinePlus notes that due to its high saturated fat content, ice cream is one food that can contribute to heart disease",
            "fat": "11",
            "calroie": "207",
            "ingredients": "milk solids-not-fat (skim-milk powder), sugar, gelatin (or other suitable stabilizer), egg and flavouring,etc",
            "img": "images/ice-cream.jpg",
            "link": "https://www.nutritionix.com/search?q=Ice%20Cream",
            "id": 11
        },
        {
            "title": "Coke",
            "body": "Drinking soda, however, has far more health risks than many of us may realize. Regular consumption of sugary drinks is linked to numerous health problems including diabetes, heart disease, asthma, COPD and obesity",
            "fat": "0",
            "calroie": "41",
            "ingredients": "Carbonated water,Sugar ,Caffeine,etc",
            "img": "images/coke.jpg",
            "link": "https://www.nutritionix.com/search?q=Coke",
            "id": 12
        },
        {
            "title": "Fruit Juice",
            "body": "You'd think juice would be healthy—it's made from fruit, after all. Problem is, while fruit is rich in fiber, juice is not. So even if you opt for 100% fruit juice and avoid drinks with added sugar (like cranberry or grape cocktail), they're still high in the sweet stuff. For instance, a cup of grape juice contains 36 grams of sugar and a cup of apple has 31 grams—not far off from what you'll find in a can of lemon-lime soda, which racks up 44 grams.",
            "fat": "0",
            "calroie": "54",
            "ingredients": "Water, high fructose corn syrup, citric acid, natural and artificial flavors, pectin, acacia gum, etc",
            "img": "images/fruit-juice.jpg",
            "link": "https://www.nutritionix.com/search?q=Fruit%20Juice",
            "id": 13
        },
        {
            "title": "Cake",
            "body": "No matter how many recipes you may see for \"healthy\" cakes, cakes aren't healthy. However, some cakes are less unhealthy than others, and if you bake your own cakes, you can make substitutions to improve their nutritional profile. Choosing angel food cake, for example, allows you to have a slice of cake without consuming the very high amounts of calories, fat, sugar and sodium found in many frosted cakes.",
            "fat": "9.9",
            "calroie": "245",
            "ingredients": "Sugar,baking powder,salt,eggs,etc",
            "img": "images/cake.jpg",
            "link": "https://www.nutritionix.com/search?q=Cake",
            "id": 14
        },
        {
            "title": "Protein bar",
            "body": "For people who are constantly on the go, nutrition bars can offer a quick, convenient, and easily portable source of calories and nutrition (because nothing good comes from being hangry in a meeting). However, according to WebMD, \"not all bars are created equal.\"  \"some of the bars have as much sugar and as much saturated fat as a candy bar. So use them in moderation.\" according to American Dietetic Association, ",
            "fat": "13",
            "calroie": "414",
            "ingredients": "Soy Protein Isolate. Sara Deeter,Calcium Caseinate. Grace Ling,etc",
            "img": "images/p-bar.jpg",
            "link": "https://www.nutritionix.com/search?q=Protein%20bar",
            "id": 15
        }
    ]
}
